000001 IDENTIFICATION DIVISION.
000002     PROGRAM-ID. MAIN.
000003 DATA DIVISION.
000004 WORKING-STORAGE SECTION.
000005
000008 01  EMPLOYEE-TABLE.
000009 05      EMPLOYEE-ENTRY OCCURS 5 TIMES.
000010 10          EMPLOYEE-NAME PIC X(20).
000011 10          HOURS-WORKED PIC 9(3).
000012 10          HOURLY-RATE PIC 9(3)V99.
000013 10          GROSS-PAY PIC 9(5)V99.
000014 10          TAX-AMT PIC 9(5)V99.
       10          TOTAL-PAY PIC 9(5)V99.
       10          EMP-COUNT PIC 9(3).      
000016        
000017 PROCEDURE DIVISION.
000018     MOVE "joe" TO EMPLOYEE-NAME(1).
000019     MOVE "tod" TO EMPLOYEE-NAME(2).
000020     MOVE "fred" TO EMPLOYEE-NAME(3).
000021     MOVE "zac" TO EMPLOYEE-NAME(4).
000022     MOVE "tim" TO EMPLOYEE-NAME(5).
000023
000024     MOVE 70 TO HOURS-WORKED(1).
000025     MOVE 70 TO HOURS-WORKED(2).
000026     MOVE 70 TO HOURS-WORKED(3).
000027     MOVE 70 TO HOURS-WORKED(4).
000028     MOVE 70 TO HOURS-WORKED(5).
000029
000030     MOVE 10.50 TO HOURLY-RATE(1).
000031     MOVE 30.50 TO HOURLY-RATE(2).
000032     MOVE 13.50 TO HOURLY-RATE(3).
000033     MOVE 13.50 TO HOURLY-RATE(4).
000034     MOVE 40.52 TO HOURLY-RATE(5).
           
           MOVE 1 TO EMP-COUNT(1).
           MOVE 2 TO EMP-COUNT(2).
           MOVE 3 TO EMP-COUNT(3).
           MOVE 4 TO EMP-COUNT(4).
           MOVE 5 TO EMP-COUNT(5).

000035     COMPUTE GROSS-PAY(1) = HOURS-WORKED(1) * HOURLY-RATE(1).
000036     COMPUTE GROSS-PAY(2) = HOURS-WORKED(2) * HOURLY-RATE(2).
000037     COMPUTE GROSS-PAY(3) = HOURS-WORKED(3) * HOURLY-RATE(3).
000038     COMPUTE GROSS-PAY(4) = HOURS-WORKED(4) * HOURLY-RATE(4).
000039     COMPUTE GROSS-PAY(5) = HOURS-WORKED(5) * HOURLY-RATE(5).
000040     
           PERFORM VARYING EMP-COUNT FROM 1 BY 1 UNTIL EMP-COUNT > 5
           COMPUTE TAX-AMT(EMP-COUNT) = GROSS-PAY(EMP-COUNT) * 0.20
000036     STOP RUN.