000001 IDENTIFICATION DIVISION.
000002     PROGRAM-ID. MAIN.
000003 DATA DIVISION.
000004 WORKING-STORAGE SECTION.
000005
000008 01  EMPLOYEE-TABLE.
000009 05      EMPLOYEE-ENTRY OCCURS 5 TIMES.
000010 10          EMPLOYEE-NAME PIC X(20).
000011 10          HOURS PIC 9(3).
000012 10          RATE PIC 9(3)V99.
000013 10          G-PAY PIC 9(5)V99.
000014 10          TAXES PIC 9(5)V99.
000015 10          PAY PIC 9(5)V99.
000016
000017 01          EMP-COUNT PIC 9(2).      
000018        
000019 PROCEDURE DIVISION.
000020     MOVE "joe" TO EMPLOYEE-NAME(1).
000021     MOVE "tod" TO EMPLOYEE-NAME(2).
000022     MOVE "fred" TO EMPLOYEE-NAME(3).
000023     MOVE "zac" TO EMPLOYEE-NAME(4).
000024     MOVE "tim" TO EMPLOYEE-NAME(5).
000025
000026     MOVE 10.50 TO RATE(1).
000027     MOVE 30.50 TO RATE(2).
000028     MOVE 13.50 TO RATE(3).
000029     MOVE 13.50 TO RATE(4).
000030     MOVE 40.52 TO RATE(5).
000031
000032     
000033     PERFORM VARYING EMP-COUNT FROM 1 BY 1 UNTIL EMP-COUNT > 5
000034         MOVE 70 TO HOURS(EMP-COUNT)
000035     COMPUTE G-PAY(EMP-COUNT) = HOURS(EMP-COUNT) * RATE(EMP-COUNT)
000036     COMPUTE TAXES(EMP-COUNT) = G-PAY(EMP-COUNT) * 0.20
000037     COMPUTE PAY(EMP-COUNT) = G-PAY(EMP-COUNT) - TAXES(EMP-COUNT)
000038     DISPLAY EMPLOYEE-NAME(EMP-COUNT) " " G-PAY(EMP-COUNT)
000039     " " TAXES(EMP-COUNT) " " PAY(EMP-COUNT)
000040     END-PERFORM
000041     STOP RUN.